[
  {"Combination":"Earth","Description":"You are grounded, dependable, and unshakable. Like solid rock beneath people’s feet, others come to you for stability and trust. You thrive in routines, responsibility, and creating things that last. Your strength is patience, persistence, and reliability.","Code":"1"},
  {"Combination":"Fire","Description":"You burn with passion and ambition. When you enter a room, people feel your energy and drive. You don’t just dream — you act, and you inspire others to act too. Fire gives you courage, charisma, and the will to take risks to change the world.","Code":"2"},
  {"Combination":"Air","Description":"You are freedom, intelligence, and curiosity. Ideas flow through you as naturally as the wind, and you love sharing them with others. People see you as witty, adaptable, and always in motion. Air makes you a natural communicator and innovator.","Code":"3"},
  {"Combination":"Water","Description":"You are empathy, intuition, and adaptability. Just like water flows and takes the shape of its container, you adjust to circumstances while bringing calmness to others. People feel safe around you because of your compassion and nurturing spirit.","Code":"4"},
  {"Combination":"Aether","Description":"You are vision, spirituality, and transcendence. Aether makes you a seeker of purpose — always searching for deeper meaning in life. You sense connections others miss and dream beyond limits. People turn to you for guidance and inspiration.","Code":"5"},

  {"Combination":"Earth + Fire","Description":"You are a force of endurance and willpower. Solid as stone but blazing with drive, you can build empires and defend them with fierce loyalty. People admire how you combine persistence with passion — you make things happen and ensure they last.","Code":"12"},
  {"Combination":"Earth + Air","Description":"You are a practical thinker, grounded in logic yet able to see the bigger picture. You’re a strategist who balances imagination with reality. Others trust you to make wise decisions because you think carefully, yet act decisively.","Code":"13"},
  {"Combination":"Earth + Water","Description":"You are a healer and nurturer of growth. Like fertile soil and nourishing rain, you help people and projects flourish. Others see you as gentle but dependable, capable of supporting both emotional and physical needs.","Code":"14"},
  {"Combination":"Earth + Aether","Description":"You are a visionary grounded in reality. Your dreams don’t float away — you anchor them in the world and make them tangible. Others see you as a bridge between what could be and what can be built.","Code":"15"},
  {"Combination":"Fire + Air","Description":"You are a spark that ignites movements. Passionate yet clever, you have the charisma to rally others behind your ideas. People follow you because you inspire hope, excitement, and change. You’re a natural innovator and leader.","Code":"23"},
  {"Combination":"Fire + Water","Description":"You are intensity balanced with compassion. Your fire gives you drive, but your water gives you empathy. Others see you as someone who can fight for justice while also caring for the wounded. You are a protector with heart.","Code":"24"},
  {"Combination":"Fire + Aether","Description":"You are the spiritual flame. People feel your energy not just as ambition, but as divine inspiration. You push others to evolve, to rise above their limitations. You’re both a leader and a torchbearer of higher ideals.","Code":"25"},
  {"Combination":"Air + Water","Description":"You are a dreamer with empathy. You communicate feelings as much as ideas, making you creative and relatable. People love your imagination and the way you express emotions in words, art, or action. You connect hearts and minds.","Code":"34"},
  {"Combination":"Air + Aether","Description":"You are a philosopher at heart. Your thoughts soar beyond the present, connecting past, future, and the unseen. Others come to you for wisdom because you explain mysteries and help people understand their own purpose.","Code":"35"},
  {"Combination":"Water + Aether","Description":"You are the mystic and intuitive guide. With compassion and foresight, you sense what others need before they even ask. People see you as deeply spiritual, almost prophetic, with a gift for healing and comforting souls.","Code":"45"},

  {"Combination":"Earth + Fire + Air","Description":"You are the builder of civilizations. Grounded, passionate, and intelligent, you create systems that last — whether communities, businesses, or families. People see you as a leader who balances strength with strategy.","Code":"123"},
  {"Combination":"Earth + Fire + Water","Description":"You are life’s shaper. You can nurture, defend, and transform all at once. Others see you as resilient and resourceful — someone who can handle destruction but always bring new growth out of it.","Code":"124"},
  {"Combination":"Earth + Fire + Aether","Description":"You are the eternal forge. You create legacies that last beyond your lifetime. People see you as both practical and visionary, someone who shapes not just the present but the future as well.","Code":"125"},
  {"Combination":"Earth + Air + Water","Description":"You are the mediator and harmonizer. You balance logic, compassion, and stability. Others trust you because you bring peace in conflicts and find solutions that respect everyone’s needs.","Code":"134"},
  {"Combination":"Earth + Air + Aether","Description":"You are the sage architect. You design not only physical structures but also ideas and philosophies. People see you as someone who builds wisdom into the world and leaves behind teachings that last.","Code":"135"},
  {"Combination":"Earth + Water + Aether","Description":"You are the guardian of life. With nurturing, foresight, and stability, you protect growth and keep balance. Others feel secure around you because you provide both safety and vision.","Code":"145"},
  {"Combination":"Fire + Air + Water","Description":"You are the revolutionary. You combine passion, empathy, and intellect to create movements that change the world. People see you as charismatic, inspiring, and unafraid to challenge the status quo.","Code":"234"},
  {"Combination":"Fire + Air + Aether","Description":"You are the cosmic messenger. Lightning is your nature — striking with both energy and vision. People see you as inspiring, electrifying, and someone who connects earth to the divine.","Code":"235"},
  {"Combination":"Fire + Water + Aether","Description":"You are the purifier. You destroy illusions with your fire and wash away what no longer serves with your water. Others see you as transformative — cleansing lives and leaving renewal behind.","Code":"245"},
  {"Combination":"Air + Water + Aether","Description":"You are the visionary empath. With intuition, creativity, and higher insight, you inspire collective dreams. People see you as someone who expresses what others only feel deep inside.","Code":"345"},

  {"Combination":"Earth + Fire + Air + Water","Description":"You are the avatar of balance. You embody all the natural forces of the world. People feel that you are whole, capable of adapting to any situation and leading with complete harmony.","Code":"1234"},
  {"Combination":"Earth + Fire + Air + Aether","Description":"You are the divine maker. You shape both the physical and the spiritual. Others see you as a creator of legacies, crafting things that endure across both worlds.","Code":"1235"},
  {"Combination":"Earth + Fire + Water + Aether","Description":"You are the eternal cycle. You embody creation, destruction, rebirth, and vision. People see you as life’s ultimate transformer, bringing new beginnings from endings.","Code":"1245"},
  {"Combination":"Earth + Air + Water + Aether","Description":"You are the grand sage. You weave logic, compassion, and vision into wisdom for generations. People see you as a teacher and guide whose influence stretches beyond time.","Code":"1345"},
  {"Combination":"Fire + Air + Water + Aether","Description":"You are the cosmic transformer. Passion, thought, empathy, and vision merge in you, making you a force of pure change. People see you as someone destined to reshape lives and societies.","Code":"2345"},

  {"Combination":"Earth + Fire + Air + Water + Aether","Description":"You are the weavekeeper, the whole circle of existence. All elements flow through you. People see you as both mortal and divine — a complete balance of strength, passion, intellect, empathy, and vision.","Code":"12345"}
]
